[
  {
    "company": "American Airlines",
    "icon": "american-airlines",
    "title": "Principal Engineer - Engineering Excellence",
    "employment_date": "Apr 2020 – Present",
    "description": "Worked in the Technology Transformation organization driving change at scale and delivering enterprise solutions in support of modernization efforts.",
    "bullets": [
      "Directly managed a team of engineers whose focus was to create a best-in-class engineer experience at American.",
      "Championed the InnerSource efforts across the company by hosting workshops, providing individual consulting to product teams, contributing code to repos, and creating an InnerSource Marketplace.",
      "Developed tools to break down collaboration barriers and elevate the voice of the engineer, including standing up an enterprise wiki and a tech landscape visualization tool.",
      "Conducted interviews for roles across the company and advocated for hiring practices that support diversity.",
      "Contributed to open source projects on behalf of American Airlines and sourced numerous projects to introduce to the open source community.",
      "Organized sponsorship of multiple college hackathons in support of American's talent pipeline.",
      "Oversaw the rollout of multiple enterprise wide tech initiatives, including Tower and Tech Radar.",
      "Developed proof-of-concepts in support of the Emerging Tech team to investigate innovative solutions."
    ]
  },
  {
    "company": "American Airlines",
    "icon": "american-airlines",
    "title": "Principal Tech Lead",
    "employment_date": "Jul 2018 – Apr 2020",
    "description": "Worked in the Airline Operations Technology organization leading the technical delivery of applications in the Safety & Security portfolio.",
    "bullets": [
      "Mentored developers across all areas of numerous projects and tech stacks.",
      "Owned and maintained the Azure Devops CI/CD pipelines for the Safety & Security portfolio.",
      "Oversaw and mentored a group of 14 new grad engineers participating in AA’s accelerated leadership program as they developed and released a production application.",
      "Introduced coding standards and implemented code reviews, linting, branching strategies, and automated testing across multiple teams.",
      "Provided technical guidance for the continued development and re-write of CERS including conversion of mobile apps into a Progressive Web App, database migration, and re-architecting to a cloud native solution.",
      "Championed and coordinated the adoption of InnerSource at American by organizing workshops, maintaining repos, and guiding teams on how to InnerSource their projects.",
      "Created roadmaps for modernizing and re-architecting numerous applications to be cloud native.",
      "Architected and deployed the first production application at American Airlines to be hosted in Azure."
    ]
  },
  {
    "company": "American Airlines",
    "icon": "american-airlines",
    "title": "Senior Software Engineer/Tech Lead",
    "employment_date": "Jan 2014 - Jul 2018",
    "description": "Worked on multiple teams across the Airline Operations Technology organization contributing to the creation of solutions for critical airline operations.",
    "bullets": [
      "Enhanced and supported multiple critical .NET applications throughout the US Airways merger.",
      "Initiated and implemented a CI/CD process for projects across the department including automated testing, linting, environment configuration and reporting.",
      "Led in the full stack development of a real time line-of-flying application used to support traffic coordinators and mechanics across the airline using Angular, .NET Core, MongoDB, and D3 on Cloud Foundry.",
      "Participated in the creation of AA’s first Angular monorepo including creating the CI/CD pipeline, contributing to shared components, and developing new applications within the monorepo.",
      "Advocated for and implemented coding standards, best practices and DevOps."
    ]
  },
  {
    "company": "Lumension Security",
    "icon": "",
    "title": "Software Developer II - Mobile",
    "employment_date": "Oct 2012 – Nov 2013",
    "description": "Worked in the newly formed mobile department to create the first version of Lumension's core product for mobile.",
    "bullets": [
      "Designed and implemented the mobile device management module of LEMSS, Lumension’s core product, from the ground up.",
      "Implemented code for all levels of the module including the front end ASP user interface.",
      "Utilized iOS and Android APIs for supporting a wide array of device security functionality, and tested on all major OS versions and manufacturer devices.",
      "Created Lumension’s Android application using C# and Xamarin."
    ]
  },
  {
    "company": "Lumension Security",
    "icon": "",
    "title": "Software Developer II - Automation",
    "employment_date": "Jan 2018 – Jun 2019",
    "description": "Worked on the Central Services team enabling test automation and overseeing production deployments.",
    "bullets": [
      "Enhanced, maintained and owned the Automation framework used to automate test cases and assure the quality of Lumension’s core product.",
      "Collaborated with the Configuration Management team to create multiple tools and plugins for TFS, including automated work item tools and source control management enhancements.",
      "Designed and implemented an automated tool for validating the output of TFS builds. This tool is currently being used on all main line builds within the company."
    ]
  },
  {
    "company": "Exponent Inc",
    "icon": "",
    "title": "Software Developer",
    "employment_date": "Mar 2009 - Aug 2010",
    "description": "Participated in the full software life cycle of a multi-million dollar US government contract for ground penetrating radar systems. Responsibilities included designing and implementing user interfaces using WPF and C# for desktop applications, implementing device interfaces, unit testing, and creating training documents.",
    "bullets": []
  },
  {
    "company": "IBM",
    "icon": "",
    "title": "Mobile Application Developer",
    "employment_date": "Jun 2007 – Feb 2009",
    "description": "Implemented the web based mobile version of Lotus Connections - IBM’s most successful new software product introduction to date - using Java and agile methodologies.",
    "bullets": []
  },
  {
    "company": "IBM",
    "icon": "",
    "title": "Software Development Co-Op",
    "oneliner": true,
    "employment_date": "Apr 2006 – Apr 2007",
    "description": "Designed and implemented Java desktop applications to aid other departments in supporting IBM hardware products.",
    "bullets": []
  }
]