[
  {
    "date": "Jun 26, 2020",
    "role": "Chief Architect, American Airlines",
    "comments": "Great job in leading the Engineering Experience survey from conception, delivery, analysis, and ultimately presenting the outcomes to our senior leaders. You've all shown such a passion for improving the experience for our people building and delivering technology at AA. Keep driving change and we will make AA a destination for world class technology talent..."
  },
  {
    "date": "Sep 24, 2020",
    "role": "Principal Tech Lead, Airline Operations Technology",
    "comments": "Your efforts in promoting culture change is pivotal in moving the bar. And it's definitely moved! Thanks for always pushing for the culture you believe in."
  },
  {
    "date": "Jun 28, 2021",
    "role": "Associate Developer, Technology Transformation",
    "comments": "I want to take this opportunity to thank Melinda for being such an empowering manager in the first year of my career. She always had faith in my ability and gave me the support I needed to become a better developer. Thank you very much Melinda!"
  },
  {
    "date": "Mar 7, 2021",
    "role": "Director of Architecture, Technology Transformation",
    "comments": "Thank you for the contributions on multiple fronts - from deep InnerSource items (like workshops) to broad efforts around our transformation efforts. Your passionate approach to making American better continues to showcase you as a leader and to help us all look at where we can apply focus to move us all forward. Your accountable efforts in keeping the InnerSource community together is wonderful to be around. Thank you!"
  },
  {
    "date": "Jun 30, 2021",
    "role": "Director of Architecture, Customer Technology",
    "comments": "Thank you for taking the time to come and present at CT-TechEx last month (twice!) and sharing all the great stuff happening in Runway and Tower! The sessions with TnT are always really well received and it's always terrific content."
  },
  {
    "date": "Jun 24, 2021",
    "role": "Senior Manager, Technology Transformation",
    "comments": "Thank you all for your support of TnT talent search. It's a time consuming process to find the right fit. From screening resume, planning the interview questions, coordinating with hiring manager, and juggling among your already busy day to day priorities to carry out the interviews. Each talent we bring onto the team, there is tremendous effort behind the scene. I really appreciate your selfless contribution to the organization."
  },
  {
    "date": "Jun 23, 2021",
    "role": "Managing Director, Cloud and Engineering Platforms",
    "comments": "For your unequivocal support of the ADEPT program. From mentoring, technical leadership, team building and creating a welcoming and supportive environment. Thank you for helping set the foundations of our future."
  },
  {
    "date": "Jun 18, 2021",
    "role": "Program Manager, ADEPT",
    "comments": "You must have super powers because I do not know how you managed an ADEPT class project and having 5 brand new ADEPTs on your team! Not only did you manage it, but from what I have seen you excelled at it. The ADEPTs have had such great things to say about you and the program is lucky to have such a supportive manager working with them. Thank you for all you have done for the ADEPTs and the program!"
  },
  {
    "date": "Aug 4, 2021",
    "role": "Manager - Mobile",
    "comments": "Thank you for all the help and contribution toward Adamson's Senior Part/Full-Time opportunity with these young adults. Working with you yesterday, you demonstrated a true passion for our younger generation and wanting them to succeed in IT."
  },
  {
    "date": "Dec 31, 2020",
    "role": "Principle Tech Lead, Airline Operations Technology",
    "comments": "Melinda, thank you for all you’ve done to promote InnerSource at American, organizing and participating in the GT Services Runway Blueprint hackathon, and setting a good example for everyone you work with in IT with your positive attitude."
  },
  {
    "date": "Mar 5, 2021",
    "role": "Senior Engineer, DevOps Toolchain",
    "comments": "Thanks for jumping in and providing your InnerSource contributions to Artifactory actions! The demo was awesome!"
  },
  {
    "date": "Oct 14, 2020",
    "role": "Mid-Level Software Engineer, Airline Operations Technology",
    "comments": "Thank you for continuing to provide me with guidance! You are truly a knowledgeable developer and I am grateful for your help."
  },
  {
    "date": "Sep 2, 2020",
    "role": "Coach, Technology Transformation",
    "comments": "Thank you for giving your time and talents to TSG this month. I appreciate you being bold and leading two sections of Tech Board. You are an important part of knowledge sharing & collaboration at American Airlines, and it shows!"
  },
  {
    "date": "Aug 26, 2020",
    "role": "Senior Developer, Customer Technology",
    "comments": "Thank you for organizing the Innersource workshops. They are always informative and helpful. I appreciate you taking the time to put these together for all of us. It's a great way to learn about the tools available to us, and how people are using those tools."
  },
  {
    "date": "Jul 20, 2020",
    "role": "Principal Program Manager, Emerging Tech",
    "comments": "Melinda, it's always so refreshing working with you each time our jobs cross paths. We get things done incredibly fast and efficiently."
  },
  {
    "date": "Mar 31, 2020",
    "role": "Principal Architect, Emerging Tech",
    "comments": "Thank you for always going above and beyond with everything related to the InnerSource community. We're all stronger because of your passion and commitment to making InnerSource an integral part of how we deliver at American!"
  },
  {
    "date": "Mar 27, 2020",
    "role": "Senior Manager, Airline Operations Technology",
    "comments": "Thanks for giving up your weekend to come and help in College Station for TAMU Hack in January. Your help ensured that we got some awesome interns for this summer. Thanks for all you do and making work fun!"
  },
  {
    "date": "Mar 23, 2020",
    "role": "Associate Developer, Airline Operations Technology",
    "comments": "Thank you for being an amazing Tech Lead. Your leadership during the SE Tool Azure cutover has been invaluable. Thank you!"
  },
  {
    "date": "Aug 9, 2021",
    "role": "Principal Engineer, IT Site Reliability",
    "comments": "Melinda continues to look out for AA's ADEPT program and push for their success. She shares her opinions and thoughts with other leaders in the interest of our ADEPTS. I have had the pleasure to work with Melinda in a few different places thought the airline and continue to welcome her opinions and engagement."
  },
  {
    "date": "Mar 20, 2020",
    "role": "Principal Tech Lead, Airline Operations Technology",
    "comments": "You work so much for your team that I ended up just taking that for granted - nights , weekends, etc. Thanks for pushing the team to get better, even when it was a challenge."
  },
  {
    "date": "Dec 13, 2019",
    "role": "Senior Analyst, Safety Assurance",
    "comments": "Thank you for all that you do every day to support the entire safety organization! Without your hard work and dedication we would not have had the successes we have had and would not be in the position we are in. Looking forward to more successes in 2020."
  },
  {
    "date": "Oct 30, 2019",
    "role": "Manager, Safety Apps",
    "comments": "CI/CD can't compare to CM (Continuous Melinda). You amaze me daily, literally daily, with the work you are able to accomplish. You have provided a non-stop continuous improvement of our systems, be it process or technological capabilities. Thank you for your hard work. Thank you for raising the bar. Thank you for being the example of HUNGRY to so many impressionable team members!"
  }
]